# read design
read_verilog Verilog_file/c432.v

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#To make easy to parse for V2TT
flatten;

# mapping logic to gates.
abc -g gates

# cleanup
clean -purge

# write synthesized design
write_json Verilog_file/c432.json
